app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `service_providers`
WHERE `status` = 'Verified'
SELECT COUNT(*) AS `numrows`
FROM `service_providers`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `service_providers`
WHERE `status` = 'Suspended'
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `status` = 'New'
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `status` = 'Contacted'
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `status` = 'Completed'
SELECT *
FROM `service_providers`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `sr`.*, `sp`.`business_name`, `u`.`name` as `user_name`
FROM `service_requests` `sr`
JOIN `service_providers` `sp` ON `sp`.`id` = `sr`.`service_provider_id`
JOIN `users` `u` ON `u`.`id` = `sr`.`user_id`
ORDER BY `sr`.`created_at` DESC
 LIMIT 5
---
    public function dashboard()
    {
        $db = \Config\Database::connect();

        // Get statistics
        $stats = [
            'providers' => [
                'total' => $db->table('service_providers')->countAllResults(),
                'verified' => $db->table('service_providers')->where('status', 'Verified')->countAllResults(),
                'pending' => $db->table('service_providers')->where('status', 'Pending')->countAllResults(),
                'suspended' => $db->table('service_providers')->where('status', 'Suspended')->countAllResults(),
            ],
            'users' => $this->userModel->getStats(),
            'requests' => [
                'total' => $db->table('service_requests')->countAllResults(),
                'new' => $db->table('service_requests')->where('status', 'New')->countAllResults(),
                'contacted' => $db->table('service_requests')->where('status', 'Contacted')->countAllResults(),
                'completed' => $db->table('service_requests')->where('status', 'Completed')->countAllResults(),
            ]
        ];

        // Recent activities
        $recentProviders = $db->table('service_providers')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        $recentRequests = $db->table('service_requests sr')
            ->select('sr.*, sp.business_name, u.name as user_name')
            ->join('service_providers sp', 'sp.id = sr.service_provider_id')
            ->join('users u', 'u.id = sr.user_id')
            ->orderBy('sr.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT `sp`.*, GROUP_CONCAT(sc.name) as categories
FROM `service_providers` `sp`
LEFT JOIN `provider_service_categories` `psc` ON `psc`.`provider_id` = `sp`.`id`
LEFT JOIN `service_categories` `sc` ON `sc`.`id` = `psc`.`category_id`
GROUP BY `sp`.`id`
ORDER BY `sp`.`created_at` DESC
---
    public function providers()
    {
        $db = \Config\Database::connect();

        $providers = $db->table('service_providers sp')
            ->select('sp.*, GROUP_CONCAT(sc.name) as categories')
            ->join('provider_service_categories psc', 'psc.provider_id = sp.id', 'left')
            ->join('service_categories sc', 'sc.id = psc.category_id', 'left')
            ->groupBy('sp.id')
            ->orderBy('sp.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT `id`, `name`, `email`, `phone`, `type`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
---
    public function users()
    {
        $users = $this->userModel->select('id, name, email, phone, type, created_at')
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT `sr`.*, `sp`.`business_name`, `u`.`name` as `user_name`, `u`.`email` as `user_email`
FROM `service_requests` `sr`
JOIN `service_providers` `sp` ON `sp`.`id` = `sr`.`service_provider_id`
JOIN `users` `u` ON `u`.`id` = `sr`.`user_id`
ORDER BY `sr`.`created_at` DESC
---
    public function requests()
    {
        $db = \Config\Database::connect();

        $requests = $db->table('service_requests sr')
            ->select('sr.*, sp.business_name, u.name as user_name, u.email as user_email')
            ->join('service_providers sp', 'sp.id = sr.service_provider_id')
            ->join('users u', 'u.id = sr.user_id')
            ->orderBy('sr.created_at', 'DESC')
            ->get()
            ->getResultArray();