app/Controllers/UserController.php

    public function dashboard()
    {
        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);

        // Get user's service requests
        $db = \Config\Database::connect();

        try {
            $requests = $db->table('service_requests sr')
                ->select('sr.*, sp.business_name, sp.owner_name, sp.phone, "General Service" as service_type')
                ->join('service_providers sp', 'sp.id = sr.service_provider_id')
                ->where('sr.user_id', $userId)
                ->orderBy('sr.created_at', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();

            // Get request statistics with error handling
            $stats = [
                'total_requests' => $db->table('service_requests')->where('user_id', $userId)->countAllResults(),
                'active_requests' => $db->table('service_requests')->where('user_id', $userId)->whereIn('status', ['New', 'Contacted'])->countAllResults(),
                'completed_requests' => $db->table('service_requests')->where('user_id', $userId)->where('status', 'Completed')->countAllResults(),
                'providers_contacted' => $db->table('service_requests')->select('service_provider_id')->where('user_id', $userId)->distinct()->countAllResults(),
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `sr`.*, `sp`.`business_name`, `sp`.`owner_name`, `sp`.`phone`, "General Service" as `service_type`
FROM `service_requests` `sr`
JOIN `service_providers` `sp` ON `sp`.`id` = `sr`.`service_provider_id`
WHERE `sr`.`user_id` = '2'
ORDER BY `sr`.`created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `user_id` = '2'
AND `status` IN ('New','Contacted')
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `user_id` = '2'
AND `status` = 'Completed'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `service_provider_id`
FROM `service_requests`
WHERE `user_id` = '2'
) CI_count_all_results

    public function profile()
    {
        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function requests()
    {
        $userId = $this->session->get('user_id');

        $db = \Config\Database::connect();
        $requests = $db->table('service_requests sr')
            ->select('sr.*, sp.business_name, sp.owner_name, sp.phone, sp.email as provider_email')
            ->join('service_providers sp', 'sp.id = sr.service_provider_id')
            ->where('sr.user_id', $userId)
            ->orderBy('sr.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `sr`.*, `sp`.`business_name`, `sp`.`owner_name`, `sp`.`phone`, `sp`.`email` as `provider_email`
FROM `service_requests` `sr`
JOIN `service_providers` `sp` ON `sp`.`id` = `sr`.`service_provider_id`
WHERE `sr`.`user_id` = '2'
ORDER BY `sr`.`created_at` DESC