app/Models/ServiceCategoryModel.php

SELECT *
FROM `service_categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC, `name` ASC
---
    public function getActiveCategories()
    {
        return $this->where('is_active', 1)
            ->orderBy('sort_order', 'ASC')
            ->orderBy('name', 'ASC')
            ->findAll();