app/Models/UserModel.php

    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@blb.gov.ug'
 LIMIT 1

    public function getStats(): array
    {
        $stats = [];
        $stats['total'] = $this->countAll();
        $stats['admins'] = $this->where('type', 'admin')->countAllResults(false);
        $stats['regular'] = $this->where('type', 'regular')->countAllResults(false);
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `type` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `type` = 'admin'
AND `type` = 'regular'